УТ_для_edt/src/DataProcessors/CRM_ОбменСMSOutlook/CRM_ОбменСMSOutlook.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_ОбменСMSOutlook</name>
  <attributes>
    <name>ПрограммаOutlook</name>
    <type>
      <types>CatalogRef.CRM_ПрограммыMSOutlook</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСохраненнойНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытьФормуСопоставленияОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПомеченныеНаУдалениеОбъекты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизироватьСобытия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизироватьЗадачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизироватьПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизироватьКонтакты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизироватьКЛК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизироватьК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизироватьЛК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьЧастныеКонтакты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьЧастныеСобытия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФильтрДатаИзмененияСобытияOutlook</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФильтрДатаИзмененияКонтактаOutlook</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоИзмененныеКонтакты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоИзмененныеСобытия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизироватьКонтактыПоПолям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступаККонтрагенту</name>
    <type>
      <types>CatalogRef.ГруппыДоступаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаКонтактов1С</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаСобытий1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСобытий1С</name>
    <type>
      <types>EnumRef.CRM_ВидыСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСобытий1С</name>
    <type>
      <types>EnumRef.CRM_ВходящееИсходящееСобытие</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСобытий1С</name>
    <type>
      <types>CatalogRef.CRM_СостоянияСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизироватьКонтактыСобытияOutlook</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизироватьУчастниковСобытияOutlook</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОбщиеНастройкиСинхронизацииОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОбщиеНастройкиСинхронизацииРеквизитов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОбщиеДополнительныеНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийOutlook</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий1С</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФильтрДатаИзмененияПисьмаOutlook</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоИзмененныеПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСобытийПисьмо</name>
    <type>
      <types>EnumRef.CRM_ВидыСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСобытийПисьмо</name>
    <type>
      <types>CatalogRef.CRM_СостоянияСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаСобытийПисьмо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВложенияПисьмо</name>
    <comment>Загружать вложения электронных  писем</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереноситьКомментарийКонтактаВOutlook</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереноситьЗаметкиКонтактаВ1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиКонтактов</name>
    <type>
      <types>DataCompositionSettingsComposer</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСобытий</name>
    <type>
      <types>DataCompositionSettingsComposer</types>
    </type>
  </attributes>
  <attributes>
    <name>ИскатьКонтактыПоАдресамEMail</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьПочтыДляСинхронизации</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Контакты</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Направление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объект_1С</name>
      <type>
        <types>CatalogRef.Партнеры</types>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения_1С</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление_Outlook</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения_Outlook</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПапкаOutlook</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКонтакта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>События</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Направление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объект_1С</name>
      <type>
        <types>DocumentRef.CRM_Взаимодействие</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения_1С</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление_Outlook</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения_Outlook</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПапкаOutlook</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствиеКонтактнойИнформации</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКИ1С</name>
      <comment>Вид контактной информации 1С</comment>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКИOutlook</name>
      <comment>Вид контактной информации Outlook</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеКИOutlook</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидКонтакта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Письма</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Направление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объект_1С</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения_1С</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление_Outlook</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения_Outlook</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПапкаOutlook</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаПапокOutlook</name>
    <attributes>
      <name>Папка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FolderPath</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>olFolder</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗагрузкаИз1С</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ_для_edt/src/InformationRegisters/CRM_СоответствиеОбъектовOutlook/CRM_СоответствиеОбъектовOutlook.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СоответствиеОбъектовOutlook</name>
  <resources>
    <name>СсылкаВOutlook</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейМодификации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ПрограммаOutlook</name>
    <type>
      <types>CatalogRef.CRM_ПрограммыMSOutlook</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СобственнаяСсылка</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/DataProcessors/CRM_ОбменСMSOutlook/Forms/Таблицы/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуСоответствиеОбъектовСервер(ТаблицаСинхронизируемыхОбъектов1С, ПрограммаOutlook, ПоОбъектамMSOutlook = Ложь)
	СоответствиеОбъектов.Очистить();
	МассивСсылок = Новый Массив();
	Для Каждого СтрокаТаблицы Из ТаблицаСинхронизируемыхОбъектов1С Цикл
		Если ПоОбъектамMSOutlook Тогда
			МассивСсылок = ТаблицаСинхронизируемыхОбъектов1С;
		Иначе
			Если ЗначениеЗаполнено(СтрокаТаблицы.Ссылка) Тогда
				МассивСсылок.Добавить(СтрокаТаблицы.Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если МассивСсылок.Количество() > 0 Тогда
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	СобственнаяСсылка КАК СобственнаяСсылка,
		|	СсылкаВOutlook КАК СсылкаВOutlook,
		|	ВЫРАЗИТЬ(СобственнаяСсылка КАК Документ.CRM_Взаимодействие).ПлановаяДата КАК Дата
		|ИЗ
		|	РегистрСведений.CRM_СоответствиеОбъектовOutlook
		|ГДЕ
		|	ПрограммаOutlook = &ПрограммаOutlook
		|	И " + ?(ПоОбъектамMSOutlook, "СсылкаВOutlook В (&МассивСсылок)", "СобственнаяСсылка В (&МассивСсылок)") + "
		|");
		Запрос.УстановитьПараметр("ПрограммаOutlook", ПрограммаOutlook);
		Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
		Таблица = Запрос.Выполнить().Выгрузить();
		ЗначениеВРеквизитФормы(Таблица, "СоответствиеОбъектов");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуКонтактыСобытийСервер(События)
	МассивСобытий = Новый Массив();
	Для Каждого СтрокаТаблицы Из События Цикл
		Если СтрокаТаблицы.Пометка И ЗначениеЗаполнено(СтрокаТаблицы.Объект_1С) Тогда
			МассивСобытий.Добавить(СтрокаТаблицы.Объект_1С);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	CRM_ВзаимодействиеСторонниеЛица.Ссылка КАК Событие,
	|	ВЫБОР
	|		КОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо ССЫЛКА Справочник.КонтактныеЛицаПартнеров
	|				И CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|			ТОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо
	|		ИНАЧЕ CRM_ВзаимодействиеСторонниеЛица.Партнер
	|	КОНЕЦ КАК Контакт,
	|	ВЫБОР
	|		КОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо ССЫЛКА Справочник.КонтактныеЛицаПартнеров
	|				И CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|			ТОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо.Наименование
	|		ИНАЧЕ CRM_ВзаимодействиеСторонниеЛица.Партнер.Наименование
	|	КОНЕЦ КАК Наименование,
	|	ВЫБОР
	|		КОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо ССЫЛКА Справочник.КонтактныеЛицаПартнеров
	|				И CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|			ТОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо.CRM_Фамилия
	|		ИНАЧЕ CRM_ВзаимодействиеСторонниеЛица.Партнер.CRM_Фамилия
	|	КОНЕЦ КАК CRM_Фамилия,
	|	ВЫБОР
	|		КОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо ССЫЛКА Справочник.КонтактныеЛицаПартнеров
	|				И CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|			ТОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо.CRM_Имя
	|		ИНАЧЕ CRM_ВзаимодействиеСторонниеЛица.Партнер.CRM_Имя
	|	КОНЕЦ КАК CRM_Имя,
	|	ВЫБОР
	|		КОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо ССЫЛКА Справочник.КонтактныеЛицаПартнеров
	|				И CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|			ТОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо.CRM_Отчество
	|		ИНАЧЕ CRM_ВзаимодействиеСторонниеЛица.Партнер.CRM_Отчество
	|	КОНЕЦ КАК CRM_Отчество,
	|	ВЫБОР
	|		КОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо ССЫЛКА Справочник.КонтактныеЛицаПартнеров
	|				И CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|			ТОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо.ПометкаУдаления
	|		ИНАЧЕ CRM_ВзаимодействиеСторонниеЛица.Партнер.ПометкаУдаления
	|	КОНЕЦ КАК ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо ССЫЛКА Справочник.КонтактныеЛицаПартнеров
	|				И CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|			ТОГДА CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо.Владелец
	|		ИНАЧЕ CRM_ВзаимодействиеСторонниеЛица.Партнер
	|	КОНЕЦ КАК Владелец
	|ИЗ
	|	Документ.CRM_Взаимодействие.СторонниеЛица КАК CRM_ВзаимодействиеСторонниеЛица
	|ГДЕ
	|	CRM_ВзаимодействиеСторонниеЛица.Ссылка В(&События)
	|	И (CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)
	|				И ТИПЗНАЧЕНИЯ(CRM_ВзаимодействиеСторонниеЛица.КонтактноеЛицо) <> ТИП(СТРОКА)
	|			ИЛИ CRM_ВзаимодействиеСторонниеЛица.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка))");
	Запрос.УстановитьПараметр("События", МассивСобытий);
	Таблица = Запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(Таблица, "КонтактыСобытий");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуСоответствиеОбъектов(ТаблицаСинхронизируемыхОбъектов1С, ПрограммаOutlook, ПоОбъектамMSOutlook = Ложь) Экспорт // АПК:78 - исключить из проверки.
	Если ПоОбъектамMSOutlook Тогда
		МассивСсылок = Новый Массив();
		Для Каждого СтрокаТаблицы Из ТаблицаСинхронизируемыхОбъектов1С Цикл
			МассивСсылок.Добавить(СтрокаТаблицы.ОбъектOutlook.ОбъектOutlook.EntryID);
		КонецЦикла;
		ЗаполнитьТаблицуСоответствиеОбъектовСервер(МассивСсылок, ПрограммаOutlook, ПоОбъектамMSOutlook);
	Иначе
		ЗаполнитьТаблицуСоответствиеОбъектовСервер(ТаблицаСинхронизируемыхОбъектов1С, ПрограммаOutlook, ПоОбъектамMSOutlook);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуКонтактыСобытий(События) Экспорт // АПК:78 - исключить из проверки.
	ЗаполнитьТаблицуКонтактыСобытийСервер(События);
КонецПроцедуры

#КонецОбласти
